# Assignment: Preparing Data for Analysis (Modified Titanic)

![](https://github.com/kaopanboonyuen/2110446_DataScience_2021s2/raw/main/%20files/hw.png)

# 1) Load data & review the data

How many rows are there in the "titanic_to_student.csv"?

In [1]:
#Import the libraries
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('titanic_to_student.csv')

In [3]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   445 non-null    int64
 1   PassengerId  445 non-null    int64
 2   Survived     432 non-null    float64
 3   Pclass       414 non-null    float64
 4   Name         433 non-null    object
 5   Sex          445 non-null    object
 6   Age          360 non-null    float64
 7   SibSp        428 non-null    float64
 8   Parch        445 non-null    int64
 9   Ticket       426 non-null    object
 10  Fare         445 non-null    float64
 11  Cabin        116 non-null    object
 12  Embarked     400 non-null    object
dtypes: float64(5), int64(3), object(5)
memory usage: 45.3+ KB

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,445.000000,445.000000,432.000000,414.000000,433,445,360.000000,428.000000,445.000000,426,445.000000,116,400
unique,NaN,NaN,NaN,NaN,433,2,NaN,NaN,NaN,359,NaN,97,3
top,NaN,NaN,NaN,NaN,"Cumings, Mrs. John Bradley (Florence Briggs Th...",male,NaN,NaN,NaN,347082,NaN,E101,S
freq,NaN,NaN,NaN,NaN,1,288,NaN,NaN,NaN,4,NaN,3,285
mean,222.000000,446.000000,0.416667,2.265700,NaN,NaN,29.136361,0.516355,0.379775,NaN,34.238473,NaN,NaN
std,128.604691,257.209383,0.493578,0.853384,NaN,NaN,14.285739,1.083067,0.795282,NaN,52.825157,NaN,NaN
min,0.000000,2.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,111.000000,224.000000,0.000000,1.000000,NaN,NaN,20.000000,0.000000,0.000000,NaN,7.925000,NaN,NaN
50%,222.000000,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,15.245800,NaN,NaN
75%,333.000000,668.000000,1.000000,3.000000,NaN,NaN,37.250000,1.000000,0.000000,NaN,34.375000,NaN,NaN
max,444.000000,890.000000,1.000000,3.000000,NaN,NaN,74.000000,8.000000,5.000000,NaN,512.329200,NaN,NaN

In [4]:
df.shape

(445, 13)

In [5]:
df.shape[0]

445

# 2) Drop unqualified variables

Drop unqualified variables

Drop variables with missing > 50%

Drop categorical variables with flat values > 70% (variables with the same value in the same column)

How many columns do we have left?

In [6]:
half_count = len(df)*0.5
print(half_count)

df.dropna(thresh=half_count, axis=1, inplace=True)

222.5

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   445 non-null    int64
 1   PassengerId  445 non-null    int64
 2   Survived     432 non-null    float64
 3   Pclass       414 non-null    float64
 4   Name         433 non-null    object
 5   Sex          445 non-null    object
 6   Age          360 non-null    float64
 7   SibSp        428 non-null    float64
 8   Parch        445 non-null    int64
 9   Ticket       426 non-null    object
 10  Fare         445 non-null    float64
 11  Embarked     400 non-null    object
dtypes: float64(5), int64(3), object(4)
memory usage: 41.8+ KB

In [8]:
df.describe()

,Unnamed: 0,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,445.000000,445.000000,432.000000,414.000000,360.000000,428.000000,445.000000,445.000000
mean,222.000000,446.000000,0.416667,2.265700,29.136361,0.516355,0.379775,34.238473
std,128.604691,257.209383,0.493578,0.853384,14.285739,1.083067,0.795282,52.825157
min,0.000000,2.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,111.000000,224.000000,0.000000,1.000000,20.000000,0.000000,0.000000,7.925000
50%,222.000000,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,15.245800
75%,333.000000,668.000000,1.000000,3.000000,37.250000,1.000000,0.000000,34.375000
max,444.000000,890.000000,1.000000,3.000000,74.000000,8.000000,5.000000,512.329200

In [9]:
df.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [10]:
df['Ticket'].value_counts().values[0]

4

In [11]:
for col in df.columns:
    if df[col].value_counts().values[0] > 0.7*df.shape[0]:
        df.drop(col, axis=1, inplace=True)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   445 non-null    int64
 1   PassengerId  445 non-null    int64
 2   Survived     432 non-null    float64
 3   Pclass       414 non-null    float64
 4   Name         433 non-null    object
 5   Sex          445 non-null    object
 6   Age          360 non-null    float64
 7   SibSp        428 non-null    float64
 8   Ticket       426 non-null    object
 9   Fare         445 non-null    float64
 10  Embarked     400 non-null    object
dtypes: float64(5), int64(2), object(4)
memory usage: 38.4+ KB

# 3) Remove all rows with missing target (the variable "Survived")

Remove all rows with missing targets (the variable "Survived")

How many rows do we have left?

In [13]:
df.dropna(subset=['Survived'], axis=0, inplace=True)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 432 entries, 0 to 444
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   432 non-null    int64
 1   PassengerId  432 non-null    int64
 2   Survived     432 non-null    float64
 3   Pclass       401 non-null    float64
 4   Name         420 non-null    object
 5   Sex          432 non-null    object
 6   Age          349 non-null    float64
 7   SibSp        415 non-null    float64
 8   Ticket       413 non-null    object
 9   Fare         432 non-null    float64
 10  Embarked     388 non-null    object
dtypes: float64(5), int64(2), object(4)
memory usage: 40.5+ KB

# 4) Handle outliers 
Handle outliers

For the variable “Fare”, replace outlier values with the boundary values

If value < (Q1 - 1.5IQR), replace with (Q1 - 1.5IQR)

If value > (Q3 + 1.5IQR), replace with (Q3 + 1.5IQR)

What is the average (mean) of “Fare” after replacing the outliers (round 2 decimal points)?

Hint: Use function round(_, 2)

In [15]:
Q1 = df['Fare'].quantile(0.25)
Q3 = df['Fare'].quantile(0.75)
iqr = Q3 - Q1

threshold = 1.5

lower_bound = Q1 - threshold * iqr
upper_bound = Q3 + threshold * iqr

df['Fare'] = df['Fare'].apply(lambda x: lower_bound if x < lower_bound 
                      else upper_bound if x > upper_bound else x)

# return round(df['Fare'].mean(), 2)

# 5) Impute missing value

Impute missing value

For number type column, impute missing values with mean

What is the average (mean) of “Age” after imputing the missing values (round 2 decimal points)?

Hint: Use function round(_, 2)

In [16]:
df.isnull().sum()

Unnamed: 0      0
PassengerId     0
Survived        0
Pclass         31
Name           12
Sex             0
Age            83
SibSp          17
Ticket         19
Fare            0
Embarked       44
dtype: int64

In [17]:
import numpy as np
from sklearn.impute import SimpleImputer

num_col = ['Age', 'SibSp', 'Fare']
text_col = ['Pclass', 'Name', 'Ticket', 'Embarked']

numImp = SimpleImputer(missing_values=np.NaN, strategy='mean')  
textImp = SimpleImputer(missing_values=np.NaN, strategy='most_frequent') 
df[num_col] = numImp.fit_transform(df[num_col])
df[text_col] = textImp.fit_transform(df[text_col])

In [18]:
df.isnull().sum()

Unnamed: 0     0
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [19]:
round(df['Age'].mean(), 2)

29.33

# 6) Convert categorical to numeric values

Convert categorical to numeric values

For the variable “Embarked”, perform the dummy coding.

What is the average (mean) of “Embarked_Q” after performing dummy coding (round 2 decimal points)?

Hint: Use function round(_, 2)

In [21]:
# from sklearn.preprocessing import OneHotEncoder

# enc = OneHotEncoder(handle_unknown='ignore')

# nominal_columns = ['Embarked']

# enc_df = pd.DataFrame(enc.fit_transform(df[nominal_columns]).toarray())

In [23]:
embarked_dummies = pd.get_dummies(df['Embarked'], prefix='Embarked')
df = pd.concat([df, embarked_dummies], axis=1)

In [24]:
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Embarked,Embarked_C,Embarked_Q,Embarked_S
0,0,2,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1.0,PC 17599,71.2833,C,True,False,False
1,1,4,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1.0,113803,53.1000,S,False,False,True
2,2,6,0.0,3.0,"Moran, Mr. James",male,29.332636,0.0,330877,8.4583,Q,False,True,False
3,3,8,0.0,3.0,"Palsson, Master. Gosta Leonard",male,2.000000,3.0,349909,21.0750,S,False,False,True
4,4,10,1.0,2.0,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1.0,237736,30.0708,C,True,False,False

In [25]:
round(df['Embarked_Q'].mean(), 2)

0.06

# 7) Partition data
Split train/test split with stratification using 70%:30% and random seed with 123

Show a proportion between survived (1) and died (0) in all data sets (total data, train, test)

What is the proportion of survivors (survived = 1) in the training data (round 2 decimal points)?

Hint: Use function round(_, 2), and train_test_split() from sklearn.model_selection

In [26]:
from sklearn.model_selection import train_test_split

X = df
y = df.pop('Survived')

X_train,X_test,y_train,y_test = train_test_split(X,y,stratify=y,test_size=0.30, random_state=123)

In [38]:
round(y_train.value_counts() / y_train.shape[0], 2)

Survived
0.0    0.58
1.0    0.42
Name: count, dtype: float64

In [39]:
round(y_train.value_counts() / y_train.shape[0], 2)[1]

0.42